sensorOpt/con/2.0_deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       217462;
    }
    right
    {
        type            patch;
        nFaces          200;
        startFace       217862;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          400;
        startFace       218062;
    }
    left
    {
        type            patch;
        nFaces          200;
        startFace       218462;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          108879;
        startFace       218662;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          108879;
        startFace       327541;
    }
    wing
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          441;
        startFace       436420;
    }
)

// ************************************************************************* //
